{
  "movies": [
    {
      "id": 1,
      "title": "Bohemian Rhapsody",
      "description":"Freddie Mercury -- the lead singer of Queen -- defies stereotypes and convention to become one of history's most beloved entertainers. The band's revolutionary sound and popular songs lead to Queen's meteoric rise in the 1970s. After leaving the group to pursue a solo career, Mercury reunites with Queen for the benefit concert Live Aid -- resulting in one of the greatest performances in rock 'n' roll history.",
      "cover":"",
      "coverMobile":"",
      "thumbnail":"./public/images/thumbnails/bohemian-rhapsody.jpg",
      "isBanner": false,
      "year": 2018,
      "rating": 4,
      "favorite": true,
      "recommended": true,
      "trend": false,
      "video": "https://www.youtube.com/embed/27zlBpzdOZg"

    },
    {
      "id": 2,
      "title": "Venom",
      "description":"Journalist Eddie Brock is trying to take down Carlton Drake, the notorious and brilliant founder of the Life Foundation. While investigating one of Drake's experiments, Eddie's body merges with the alien Venom -- leaving him with superhuman strength and power. Twisted, dark and fueled by rage, Venom tries to control the new and dangerous abilities that Eddie finds so intoxicating.",
      "cover":"./public/images/banners/banner-venom.png",
      "coverMobile":"./public/images/banners/banner-venom-mob.png",
      "thumbnail":"./public/images/thumbnails/venom.jpg",
      "isBanner": true,
      "year": 2018,
      "rating": 3,
      "favorite": false,
      "recommended": true,
      "trend": false,
      "video": "https://www.youtube.com/embed/u9Mv98Gr5pY"
    },
    {
      "id": 3,
      "title": "Avengers: Infinity War",
      "description":"Iron Man, Thor, the Hulk and the rest of the Avengers unite to battle their most powerful enemy yet -- the evil Thanos. On a mission to collect all six Infinity Stones, Thanos plans to use the artifacts to inflict his twisted will on reality. The fate of the planet and existence itself has never been more uncertain as everything the Avengers have fought for has led up to this moment.",
      "cover":"",
      "coverMobile":"",
      "thumbnail":"./public/images/thumbnails/avengers-infinity-war.png",
      "isBanner": false,
      "year": 2018,
      "rating": 5,
      "favorite": true,
      "recommended": true,
      "trend": true,
      "video": "https://www.youtube.com/embed/6ZfuNTqbHE8"
    },
    {
      "id": 4,
      "title": "First Man",
      "description":"Hoping to reach the moon by the end of the decade, NASA plans a series of extremely dangerous, unprecedented missions in the early 1960s. Engineer Neil Armstrong joins the space program, spending years in training and risking his life during test flights. On July 16, 1969, the nation and world watch in wonder as Armstrong and fellow astronauts Buzz Aldrin and Michael Collins embark on the historic Apollo 11 spaceflight.",
      "cover":"",
      "coverMobile":"",
      "thumbnail":"./public/images/thumbnails/first-man.jpg",
      "isBanner": false,
      "year": 2018,
      "rating": 3,
      "favorite": false,
      "recommended": false,
      "trend": false,
      "video": "https://www.youtube.com/embed/PSoRx87OO6k"
    },
    {
      "id": 5,
      "title": "Solo: A Star Wars Story",
      "description":"Young Han Solo finds adventure when he joins forces with a gang of galactic smugglers and a 190-year-old Wookie named Chewbacca. Indebted to the gangster Dryden Vos, the crew devises a daring plan to travel to the mining planet Kessel to steal a batch of valuable coaxium. In need of a fast ship, Solo meets Lando Calrissian, the suave owner of the perfect vessel for the dangerous mission -- the Millennium Falcon.",
      "cover":"",
      "coverMobile":"",
      "thumbnail":"./public/images/thumbnails/han-solo.jpg",
      "isBanner": false,
      "year": 2018,
      "rating": 4,
      "favorite": true,
      "recommended": false,
      "trend": false,
      "video": "https://www.youtube.com/embed/jPEYpryMp2s"
    },
    {
      "id": 6,
      "title": "Incredibles 2",
      "description":"Telecommunications guru Winston Deavor enlists Elastigirl to fight crime and make the public fall in love with superheroes once again. That leaves Mr. Incredible with one of his greatest challenges ever -- staying home and taking care of three rambunctious children. As Violet, Dash and Jack-Jack offer him a new set of headaches, a cybercriminal named Screenslaver launches his dastardly plan -- hypnotizing the world through computer screens.",
      "cover":"",
      "coverMobile":"",
      "thumbnail":"./public/images/thumbnails/incredibles.jpg",
      "isBanner": false,
      "year": 2018,
      "rating": 4,
      "favorite": true,
      "recommended": true,
      "trend": false,
      "video": "https://www.youtube.com/embed/i5qOzqD9Rms"
    },
    {
      "id": 7,
      "title": "Jurassic World",
      "description":"Located off the coast of Costa Rica, the Jurassic World luxury resort provides a habitat for an array of genetically engineered dinosaurs, including the vicious and intelligent Indominus rex. When the massive creature escapes, it sets off a chain reaction that causes the other dinos to run amok. Now, it's up to a former military man and animal expert (Chris Pratt) to use his special skills to save two young brothers and the rest of the tourists from an all-out, prehistoric assault.",
      "cover":"",
      "coverMobile":"",
      "thumbnail":"./public/images/thumbnails/jurassic-world.jpg",
      "isBanner": false,
      "year": 2015,
      "rating": 2,
      "favorite": true,
      "recommended": false,
      "trend": true,
      "video": "https://www.youtube.com/embed/RFinNxS5KN4"
    },
    {
      "id": 8,
      "title": "Deadpool",
      "description":"Wade Wilson (Ryan Reynolds) is a former Special Forces operative who now works as a mercenary. His world comes crashing down when evil scientist Ajax (Ed Skrein) tortures, disfigures and transforms him into Deadpool. The rogue experiment leaves Deadpool with accelerated healing powers and a twisted sense of humor. With help from mutant allies Colossus and Negasonic Teenage Warhead (Brianna Hildebrand), Deadpool uses his new skills to hunt down the man who nearly destroyed his life.",
      "cover":"",
      "coverMobile":"",
      "thumbnail":"./public/images/thumbnails/deadpool.png",
      "isBanner": false,
      "year": 2016,
      "rating": 3,
      "favorite": true,
      "recommended": true,
      "trend": false,
      "video": "https://www.youtube.com/embed/0JnRdfiUMa8"
    },
    {
      "id": 9,
      "title": "Aquaman",
      "description":"Once home to the most advanced civilization on Earth, the city of Atlantis is now an underwater kingdom ruled by the power-hungry King Orm. With a vast army at his disposal, Orm plans to conquer the remaining oceanic people -- and then the surface world. Standing in his way is Aquaman, Orm's half-human, half-Atlantean brother and true heir to the throne. With help from royal counselor Vulko, Aquaman must retrieve the legendary Trident of Atlan and embrace his destiny as protector of the deep.",
      "cover":"./public/images/banners/banner-aquaman.jpg",
      "coverMobile":"./public/images/banners/banner-aquaman-mob.jpg",
      "thumbnail":"./public/images/thumbnails/aquaman.jpg",
      "isBanner": true,
      "year": 2018,
      "rating": 1,
      "favorite": false,
      "recommended": false,
      "trend": false,
      "video": "https://www.youtube.com/embed/WDkg3h8PCVU"
    },
    {
      "id": 10,
      "title": "bumblebee",
      "description":"On the run in the year 1987, Bumblebee the Autobot seeks refuge in a junkyard in a small California beach town. Charlie, on the brink of turning 18 years old and trying to find her place in the world, soon discovers the battle-scarred and broken Bumblebee. When Charlie revives him, she quickly learns that this is no ordinary yellow Volkswagen.",
      "cover":"./public/images/banners/banner-bumblebee.jpg",
      "coverMobile":"./public/images/banners/banner-bumblebee-mob.jpg",
      "thumbnail":"./public/images/thumbnails/bumblebee.jpg",
      "isBanner": true,
      "year": 2018,
      "rating": 2,
      "favorite": false,
      "recommended": false,
      "trend": false,
      "video": "https://www.youtube.com/embed/lcwmDAYt22k"
    }
  ]
}